# -*- coding: UTF-8 -*-
from pytagcloud import create_tag_image, make_tags
from pytagcloud.lang.counter import get_tag_counts
YOUR_TEXT = u"前世是真武大帝、大秦皇帝和逍遥陆地散人，澹台平静的师傅。前世皇后为洛阳，爱妃为姜泥。北凉王世子，以纨绔形象著称于世，实则胸藏沟壑，腹有良谋。劣马黄酒六千里归来，仗剑游历天下。配双刀，一身大黄庭，内外兼修，誓要将江湖捅一个通透。师从国士李义山。人屠徐骁的嫡长子，母亲吴素。拒与隋珠公主成婚被强制游历三年六千里，得知老仆剑九黄死于武帝城头就跟湖底老魁学练刀，后去武当山得前任掌教王重楼于洗象池灌顶六重大黄庭关。得其五六，初试能用一二；每日听各种武学秘籍，自行修得一重；襄樊城白衣观音带万鬼夜行一看下又有奥妙裨益，登上二重；芦苇荡一战十九刀破符将红甲，以剑九入刀九刀逼退呵呵而身负重伤，后得金刚境4重大黄庭，36大穴72小窍共开启窍穴68，体魄不堪重负濒临死亡。后孤身入北莽诛杀提兵山主指玄境第五貉而入伪指玄境一夜白发，耗尽气运诛杀老僧杨太岁又入伪天象境。出京后在幽燕山庄与南海观音宗练气士一战境界再度上升。靠隋老怪万里借剑诛杀大内首宦韩貂寺，借助阴物学得人猫红绳之术。春神湖上与赵凝神斗法请真武大帝下界击溃赵凝神所请龙虎山初代祖师法身，使得天师府龙池气运莲枯萎殆尽。借洛阳之力败退柳蒿师。前世大秦皇帝现逼王仙芝后退千丈。与高树露一战赢在境界，得树露尤胜大金刚体魄。后神游梦春秋大战仙芝，先集天下气运，后道家一气化三清，融合3教精髓入天人境界，击溃仙芝肉身。仙芝不肯飞升自解魂魄。因在和王仙芝对战中，树露体魄被击散，加上气运流失跌境。在丹种坪上一句“去吧”借剑数万再入天人境胜隋斜谷。后在替徐龙象抵挡七重雷劫时因北莽真龙插手，7重变8重请下真武大帝、大秦皇帝、澹台平静师傅，怒斩北莽真龙，与前世彻底撇清。己身实力下降，后经外公齐练华调和，稍稍稳定。后与拓跋菩萨在西域转战数月，差一线取下其人头，因李密弼插手而功亏一篑，被姜泥所救。后于太安城下马嵬驿馆与邓太阿、曹长卿过招，以一敌二。次日于钦天监斩杀无数仙人，借助衍圣公赠与的儒家气运玺，破两座大阵，并打碎谢飞鱼手中碗。祥符三年春，携一万大雪龙骑南下，接回姜泥"

tags = make_tags(get_tag_counts(YOUR_TEXT), maxsize=80)
create_tag_image(tags, 'cloud_large.png', size=(1000,800), fontname='SimHei')
